"""Поработайте с переменными, создайте несколько, выведите на экран,
запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран. """
a = 27
b = 'Hello'
c = 15.7
d = c == 15.9

print('a =', a, 'type:', type(a))
print('b =', b, 'type:', type(b))
print('c =', c, 'type:', type(c))
print('d =', d, 'type:', type(d))

x = input('Введите числa: ')
print (x)

y = input('Введите слова: ')
print (y)

z = int(input('Сколько вам лет?: '))
print (z)
# Надеюсь, я правильно поняла задание